### DataFrame is a main object in Pandas.
### It is used to represent data with rows and columns

In [1]:
from pandas import DataFrame

In [2]:
data = {
    'Names':['John', 'Jane', 'Harry', 'Watson','James'],
    'ID':[1001, 1002, 1003, 1004, 1005],
    'Score':[75, 82, 63, 91, 71 ],
}

#### Coverting Above Dictionary into DataFrame

In [3]:
student_data = DataFrame(data)
student_data

    Names    ID  Score
0    John  1001     75
1    Jane  1002     82
2   Harry  1003     63
3  Watson  1004     91
4   James  1005     71

In [4]:
type(student_data)

pandas.core.frame.DataFrame

#### Number of Rows and Columns of student_data

In [5]:
rows, cols = student_data.shape
print('Rows:',rows)
print('Columns:',cols)

Rows: 5
Columns: 3

#### Column Names

In [6]:
student_data.columns

Index(['Names', 'ID', 'Score'], dtype='object')

#### Retrieving first 3 rows

In [7]:
student_data.head(3)

   Names    ID  Score
0   John  1001     75
1   Jane  1002     82
2  Harry  1003     63

#### Retrieving Last 2 rows

In [8]:
student_data.tail(2)

    Names    ID  Score
3  Watson  1004     91
4   James  1005     71

#### Print Names

In [9]:
student_data['Names'] #Or use student_data.Names

0      John
1      Jane
2     Harry
3    Watson
4     James
Name: Names, dtype: object

#### Retrieve Id and Grade

In [10]:
student_data[['ID','Score']]

     ID  Score
0  1001     75
1  1002     82
2  1003     63
3  1004     91
4  1005     71

#### Score Statistics

In [11]:
student_data['Score'].describe()

count     5.000000
mean     76.400000
std      10.667708
min      63.000000
25%      71.000000
50%      75.000000
75%      82.000000
max      91.000000
Name: Score, dtype: float64

#### Retrieve Data whose score >= 75

In [12]:
scores = student_data['Score']
student_data[scores >= 75]

    Names    ID  Score
0    John  1001     75
1    Jane  1002     82
3  Watson  1004     91